"""Дано k відсортованих списків цілих чисел. Ваше завдання — об'єднати їх у 
один відсортований список. При виконанні завдання можете опиратися на алгоритм 
сортування злиттям з конспекту. Реалізуйте функцію merge_k_lists , яка приймає 
на вхід список відсортованих списків та повертає відсортований список."""

def merge_two_lists(list1, list2):
    """
    Об'єднує два відсортованих списки в один відсортований список.
    """
    merged_list = []  # Ініціалізація порожнього списку для злиття
    i, j = 0, 0  # Індекси для обходу елементів у двох списках

    # Проходимо через обидва списки до тих пір, поки не досягнемо кінця одного з них
    while i < len(list1) and j < len(list2):
        # Порівнюємо елементи з обох списків і додаємо менший до результату
        if list1[i] < list2[j]:
            merged_list.append(list1[i])
            i += 1
        else:
            merged_list.append(list2[j])
            j += 1

    # Додаємо залишки з обох списків (один зі списків може мати додаткові елементи)
    merged_list.extend(list1[i:])
    merged_list.extend(list2[j:])
    return merged_list

def merge_k_lists(lists):
    """
    Об'єднує k відсортованих списків в один відсортований список.
    """
    if not lists:
        return []  # Якщо список списків порожній, повертаємо порожній список

    # Повторюємо процес злиття, поки не залишиться один відсортований список
    while len(lists) > 1:
        merged_lists = []  # Список для зберігання тимчасових результатів злиття
        # Проходимо через список списків парами
        for i in range(0, len(lists), 2):
            list1 = lists[i]
            list2 = lists[i + 1] if i + 1 < len(lists) else []  # Якщо пара неповна, використовуємо порожній список
            merged_lists.append(merge_two_lists(list1, list2))  # Злиття поточної пари списків
        lists = merged_lists  # Оновлюємо список списків результатами злиття

    return lists[0]  # Повертаємо єдиний відсортований список

# Приклад використання
lists = [[1, 4, 5], [1, 3, 4], [2, 6]]
merged_list = merge_k_lists(lists)
print("Відсортований список:", merged_list)
